/* No comment provided by engineer. */
"%@ to %@" = "%1$@ para %2$@";

/* No comment provided by engineer. */
"%d of %d" = "%1$d de %2$d";

/* No comment provided by engineer. */
"%li to %li" = "%1$li para %2$li";

/* No comment provided by engineer. */
"'item' parameter required" = "Parâmetro 'item’ necessário.";

/* No comment provided by engineer. */
"'portal' parameter required" = "Parâmetro 'portal’ necessário.";

/* No comment provided by engineer. */
"'tags' parameter required" = "Parâmetro 'palavras-chave’ necessário.";

/* No comment provided by engineer. */
"'title' parameter required" = "Parâmetro 'título’ necessário.";

/* No comment provided by engineer. */
"+/-" = "+/-";

/* No comment provided by engineer. */
"<No value>" = "<Sem valor>";

/* No comment provided by engineer. */
"Access to the device location is denied." = "Acesso à localização do dispositivo recusada.";

/* No comment provided by engineer. */
"Actual Size" = "Tamanho actual";

/* No comment provided by engineer. */
"Add" = "Adicionar";

/* No comment provided by engineer. */
"Add Attachment" = "Adicionar Anexo";

/* No comment provided by engineer. */
"Add..." = "Adicionar...";

/* No comment provided by engineer. */
"An itemID is required for this operation. Add this item to the Portal to get an ItemID." = "É necessária uma itemID para efetuar esta operação. Adicione este item ao Portal para obter uma ItemID.";

/* No comment provided by engineer. */
"An uncaught NSException was detected, however the original information and callstack is not available. Break on objective-c exceptions to see the line of code causing the original NSException. For more information on how to do this please see the documentation." = "Foi encontrada uma NSException não detetada, no entanto, as informações originais e a pilha de execução não se encontram disponíveis. Quebra nas exceções objective-c para visualizar a linha de código causadora da NSException original. Para obter mais informações sobre como fazer isto, por favor, consulte a documentação.";

/* No comment provided by engineer. */
"Apply Geometry" = "Aplicar Geometria";

/* No comment provided by engineer. */
"At least 1 facility is required to solve a route." = "É necessária pelo menos 1 instalação para resolver uma rota.";

/* No comment provided by engineer. */
"At least 1 incident is required to solve a route." = "É necessária pelo menos 1 incidente para resolver uma rota.";

/* No comment provided by engineer. */
"At least 2 stops are required to solve a route." = "São necessárias pelo menos 2 paragens para resolver uma rota.";

/* No comment provided by engineer. */
"Attachment" = "Anexo";

/* No comment provided by engineer. */
"Attachments" = "Anexos";

/* No comment provided by engineer. */
"Attempt to use functionality that is not supported for the current license level" = "Tentativa de utilizar funcionalidade não suportada para o atual nível de licença.";

/* No comment provided by engineer. */
"Authorization required" = "Autorização necessária";

/* No comment provided by engineer. */
"Bad Request" = "Pedido mau";

/* No comment provided by engineer. */
"Bad URL." = "URL Errado.";

/* No comment provided by engineer. */
"bytes" = "bytes";

/* No comment provided by engineer. */
"Cancel" = "Cancelar";

/* No comment provided by engineer. */
"Cannot save to a different item type." = "Não pode guardar num tipo de item diferente.";

/* No comment provided by engineer. */
"Cannot verify the identity of '%@'" = "Não é possível verificar a identidade de '%@'";

/* No comment provided by engineer. */
"Certificate Required" = "Certificado Necessário";

/* No comment provided by engineer. */
"Challenge for URL: %@ with failureCount: %lu" = "Desafio para URL: %1$@ com failureCount: %2$lu";

/* No comment provided by engineer. */
"Changing Feature Type" = "A alterar o tipo de elemento";

/* No comment provided by engineer. */
"Choose From Library" = "Escolher da biblioteca";

/* No comment provided by engineer. */
"Clear" = "Apagar";

/* No comment provided by engineer. */
"Clear Geometry" = "Limpar Geometria";

/* No comment provided by engineer. */
"Continue" = "Continuar";

/* No comment provided by engineer. */
"Created %d hours ago" = "Criado %d horas atrás";

/* No comment provided by engineer. */
"Created %d minutes ago" = "Criado %d minutos atrás";

/* No comment provided by engineer. */
"Created a minute ago" = "Criado um minuto atrás";

/* No comment provided by engineer. */
"Created an hour ago" = "Criado uma hora atrás";

/* No comment provided by engineer. */
"Created by %@" = "Criado por %@";

/* No comment provided by engineer. */
"Created by %@ %d hours ago" = "Criado por %1$@ %2$d horas atrás";

/* No comment provided by engineer. */
"Created by %@ %d minutes ago" = "Criado por %1$@ %2$d minutos atrás";

/* No comment provided by engineer. */
"Created by %@ a minute ago" = "Criado por %@ um minuto atrás";

/* No comment provided by engineer. */
"Created by %@ an hour ago" = "Criado por %@ uma hora atrás";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - day" = "Criado por %1$@ em %2$@ às %3$@ - dia";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - full" = "Criado por %1$@ em %2$@ às %3$@ - completo";

/* No comment provided by engineer. */
"Created by %@ seconds ago" = "Criado por %@ segundos atrás";

/* No comment provided by engineer. */
"Created on %@ at %@ - day" = "Criado em %1$@ às %2$@ - dia";

/* No comment provided by engineer. */
"Created on %@ at %@ - full" = "Criado em %1$@ às %2$@ - completo";

/* No comment provided by engineer. */
"Created seconds ago" = "Criado segundos atrás";

/* No comment provided by engineer. */
"Credential Required" = "Credencial Necessária";

/* No comment provided by engineer. */
"Data for pie chart is invalid" = "Os dados para o gráfico circular não são válidos";

/* No comment provided by engineer. */
"Delete" = "Eliminar";

/* No comment provided by engineer. */
"Delete Attachment" = "Eliminar Anexo.";

/* No comment provided by engineer. */
"Delete Feature" = "Eliminar Elemento";

/* No comment provided by engineer. */
"Deleting this attachment will remove it from the popup and associated data source." = "A eliminação deste anexo removê-lo-á da janela pop-up e da origem de dados associada.";

/* No comment provided by engineer. */
"Deleting this feature will remove it from the map and associated data source." = "A eliminação deste elemento removê-lo-á do mapa e da origem de dados associada.";

/* No comment provided by engineer. */
"Directions time and distance attributes do not match." = "Os atributos de tempo e distância não coincidem.";

/* No comment provided by engineer. */
"Edit" = "Editar";

/* No comment provided by engineer. */
"Edited %d hours ago" = "Editado %d horas atrás";

/* No comment provided by engineer. */
"Edited %d minutes ago" = "Editado %d minutos atrás";

/* No comment provided by engineer. */
"Edited a minute ago" = "Editado um minuto atrás";

/* No comment provided by engineer. */
"Edited an hour ago" = "Editado uma hora atrás";

/* No comment provided by engineer. */
"Edited by %@" = "Editado por %@";

/* No comment provided by engineer. */
"Edited by %@ %d hours ago" = "Editado por %1$@ %2$d horas atrás";

/* No comment provided by engineer. */
"Edited by %@ %d minutes ago" = "Editado por %1$@ %2$d minutos atrás";

/* No comment provided by engineer. */
"Edited by %@ a minute ago" = "Editado por %@ um minuto atrás";

/* No comment provided by engineer. */
"Edited by %@ an hour ago" = "Editado por %@ uma hora atrás";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - day" = "Editado por %1$@ em %2$@ às %3$@ - dia";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - full" = "Editado por %1$@ em %2$@ às %3$@ - completo";

/* No comment provided by engineer. */
"Edited by %@ seconds ago" = "Editado por %@ segundos atrás";

/* No comment provided by engineer. */
"Edited on %@ at %@ - day" = "Editado em %1$@ às %2$@ - dia";

/* No comment provided by engineer. */
"Edited on %@ at %@ - full" = "Editado em %1$@ às %2$@ - completo";

/* No comment provided by engineer. */
"Edited seconds ago" = "Editado segundos atrás";

/* No comment provided by engineer. */
"Empty username/password" = "Nome de utilizador/palavra-passe vazios";

/* No comment provided by engineer. */
"Enter a date between %@ and %@" = "Introduza uma data entre %1$@ and %2$@";

/* No comment provided by engineer. */
"Enter a number between %@ and %@" = "Introduza um número entre %1$@ e %2$@";

/* No comment provided by engineer. */
"Enter a number between %i and %i" = "Introduza um número entre %1$i e %2$i";

/* No comment provided by engineer. */
"Error" = "Erro";

/* No comment provided by engineer. */
"Error adding identity to the keychain" = "Erro ao adicionar a idendidade ao keychain";

/* No comment provided by engineer. */
"Error adding keychain item" = "Erro ao adicionar item de keychain";

/* No comment provided by engineer. */
"Error extracting identity" = "Erro ao extrair a idendidade";

/* No comment provided by engineer. */
"Error Loading Page" = "Erro ao Carregar a Página";

/* No comment provided by engineer. */
"Error removing keychain item" = "Erro ao remover item de keychain";

/* No comment provided by engineer. */
"Error updating keychain item" = "Erro ao atualizar item de keychain";

/* No comment provided by engineer. */
"Exceeds maximum value (%@)" = "Excede o valor máximo (%@)";

/* No comment provided by engineer. */
"Extra Large" = "Extra Grande";

/* No comment provided by engineer. */
"Facility (%1$@) has invalid added cost attribute names (%2$@)." = "Instalação (%1$@) tem nomes de atributos de custos adicionais inválidos (%2$@).";

/* No comment provided by engineer. */
"Facility (%1$@) has negative added cost attribute (%2$@)." = "Instalação (%1$@) tem atributos de custos adicionais negativos (%2$@).";

/* No comment provided by engineer. */
"Feature isn't valid." = "O elemento não é válido.";

/* No comment provided by engineer. */
"Finish" = "Terminar";

/* No comment provided by engineer. */
"Finishing editing..." = "A concluir a edição...";

/* No comment provided by engineer. */
"GB" = "GB";

/* No comment provided by engineer. */
"Geometry" = "Geometria";

/* No comment provided by engineer. */
"Hide" = "Esconder";

/* No comment provided by engineer. */
"Incident (%1$@) has invalid added cost attribute names (%2$@)." = "Incidente (%1$@) tem nomes de atributos de custos adicionais negativos (%2$@).";

/* No comment provided by engineer. */
"Incident (%1$@) has negative added cost attribute (%2$@)." = "Incidente (%1$@) tem atributos de custos adicionais negativos (%2$@).";

/* No comment provided by engineer. */
"Insert Part" = "Inserir Parte";

/* No comment provided by engineer. */
"Insert Vertex" = "Inserir Vértice";

/* No comment provided by engineer. */
"Invalid argument." = "Argumento inválido";

/* No comment provided by engineer. */
"Invalid Credentials" = "Credenciais Inválidas";

/* No comment provided by engineer. */
"Invalid GPX data." = "Dados GPX inválidos.";

/* No comment provided by engineer. */
"Invalid groupID." = "groupID inválido.";

/* No comment provided by engineer. */
"Joining this organization is supported by invitation only, you need to receive an invitation from the administrator" = "A adesão a esta organização é suportada apenas por convite, é necessário que receba um convite do administrador.";

/* No comment provided by engineer. */
"KB" = "KB";

/* No comment provided by engineer. */
"Keep Current Values" = "Manter Valores Atuais";

/* No comment provided by engineer. */
"Large" = "Grande";

/* No comment provided by engineer. */
"Less than minimum value (%@)" = "Inferior ao valor mínimo (%@)";

/* No comment provided by engineer. */
"Licensed for Developer Use Only" = "Licenciado Apenas para Utilização por parte de Programadores";

/* No comment provided by engineer. */
"Loading feature..." = "A carregar elemento...";

/* No comment provided by engineer. */
"Map contains data that cannot be saved. To save this map, which will remove this data, pass true for forceSaveToSupportedVersion." = "O mapa contém dados que não podem ser guardados. Para guardar este mapa, que irá remover estes dados, selecione verdadeiro para forceSaveToSupportedVersion.";

/* No comment provided by engineer. */
"MB" = "MB";

/* No comment provided by engineer. */
"Medium" = "Média";

/* No comment provided by engineer. */
"Missing client certificate" = "Certificado de cliente em falta";

/* string to represent hyperlink attributes */
"More Info" = "Mais Informações";

/* No comment provided by engineer. */
"Move Geometry" = "Mover Geometria";

/* No comment provided by engineer. */
"Move Part" = "Mover Peça";

/* No comment provided by engineer. */
"Move Vertex" = "Mover Vértice";

/* No comment provided by engineer. */
"No certificate found to access the resource '%@'" = "Não foi encontrado qualquer certificado para aceder ao recurso '%@'";

/* No comment provided by engineer. */
"No data to create a bar chart" = "Não existem dados para criar um gráfico de barras";

/* No comment provided by engineer. */
"No data to create a line chart" = "Não existem dados para criar um gráfico de linhas";

/* No comment provided by engineer. */
"No data to create a pie chart" = "Não existem dados para criar um gráfico circular";

/* No comment provided by engineer. */
"No image to display" = "Nenhuma imagem para exibir";

/* No comment provided by engineer. */
"No path can be found between a given pair of stops (%@)." = "Não é possível encontrar nenhum caminho entre um determinado par de paragens (%@).";

/* No comment provided by engineer. */
"Not a valid number" = "Não é um número válido";

/* No comment provided by engineer. */
"Not a valid whole number" = "Não é um número inteiro válido";

/* No comment provided by engineer. */
"Object cannot be created without a portal.  Use fromJSON:withPortal:error: method instead." = "O objeto não pode ser criado sem um portal.  Utilize o método fromJSON:withPortal:error: ao invés.";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"One or more accumulate attribute names (%@) are invalid." = "Um ou mais nomes de atributos acumulados (%@) são inválidos.";

/* No comment provided by engineer. */
"One or more attribute names (%@) associated with the custom parameter attribute values are invalid." = "Um ou mais nomes de atributos (%@) associados aos valores de atributos de parâmetro personalizado são inválidos.";

/* No comment provided by engineer. */
"One or more facilities (%@) have a null geometry." = "Uma ou mais instalações (%@) possuem uma geometria nula.";

/* No comment provided by engineer. */
"One or more facilities (%@) have an invalid curb approach." = "Uma ou mais instalações (%@) possuem uma aproximação de curva inválida.";

/* No comment provided by engineer. */
"One or more facilities (%@) have invalid impedance cutoff." = "Uma ou mais instalações (%@) possuem um limite de impedância inválido.";

/* No comment provided by engineer. */
"One or more incidents (%@) have a null geometry." = "Um ou mais incidentes (%@) possuem um geometria nula.";

/* No comment provided by engineer. */
"One or more incidents (%@) have an invalid curb approach." = "Um ou mais incidentes (%@) possuem uma aproximação de curva inválida.";

/* No comment provided by engineer. */
"One or more incidents (%@) have invalid impedance cutoff." = "Um ou mais incidentes (%@) possuem um limite de impedância inválido.";

/* No comment provided by engineer. */
"One or more incidents (%@) have less than 1 target facility count." = "Um ou mais incidentes (%@) tem menos do que 1 na contagem de instalações-alvo.";

/* No comment provided by engineer. */
"One or more parameter names (%@) associated with the custom parameter attribute values are invalid." = "Um ou mais nomes de parâmetros (%@) associados aos valores de atributos de parâmetro personalizado são inválidos.";

/* No comment provided by engineer. */
"One or more parameter value types associated with the custom parameter attribute values (%@) are invalid." = "Um ou mais tipos de valores de parâmetros associados aos valores de atributos de parâmetro personalizado (%@) são inválidos.";

/* No comment provided by engineer. */
"One or more point barriers (%@) are unlocated." = "Uma ou mais barreiras de pontos (%@) não possuem localização.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have a null geometry." = "Uma ou mais barreiras de pontos (%@) possuem um geometria nula.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid added cost attribute name." = "Uma ou mais barreiras de pontos (%@) possuem um nome de atributo de custo adicional inválido.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid curb approach." = "Uma ou mais barreiras de pontos (%@) possuem uma aproximação de curva inválida.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) does not cover any network elements." = "Uma ou mais barreiras de polígonos (%@) não cobre quaisquer elementos da rede.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have a null geometry." = "Uma ou mais barreiras de polígonos (%@) possuem um geometria nula.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have an invalid scaled cost attribute name." = "Uma ou mais barreiras de pontos (%@) possuem um nome de atributo de custo escalado inválido.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) does not cover any network elements." = "Uma ou mais barreiras de polilinhas (%@) não cobre quaisquer elementos da rede.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have a null geometry." = "Uma ou mais barreiras de polilinhas (%@) possuem um geometria nula.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have an invalid scaled cost attribute name." = "Uma ou mais barreiras de polilinhas (%@) possuem um nome de atributo de custo escalado inválido.";

/* No comment provided by engineer. */
"One or more restriction attribute names (%@) are invalid." = "Um ou mais nomes de atributos restrição (%@) são inválidos.";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values (%2$@) are invalid." = "Um ou mais valores de restrição de utilização (%1$@) associados aos valores de atributos de parâmetro personalizado (%2$@) são inválidos";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values ((%2$@) are neutral (i.e., have no effect)." = "Um ou mais valores de restrição de utilização (%1$@) associados aos valores de atributos de parâmetro personalizado (%2$@) são neutros (i.e., não têm qualquer efeito).";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a non-traversable element." = "Uma ou mais paragens (%@) encontram-se localizadas num elemento não atravessável.";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a soft-restricted element." = "Uma ou mais paragens (%@) encontram-se localizadas num elemento restrito soft.";

/* No comment provided by engineer. */
"One or more stops (%@) are unlocated." = "Uma ou mais paragens (%@) não possuem localização.";

/* No comment provided by engineer. */
"One or more stops (%@) cannot be reached from other stops." = "Uma ou mais paragens (%@) não podem ser alcançadas a partir de outras paragens.";

/* No comment provided by engineer. */
"One or more stops (%@) have a null geometry." = "Uma ou mais paragens (%@) possuem uma geometria nula.";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window end that occurs before its time window start." = "Uma ou mais paragens (%@) possuem um final de janela temporal que ocorre antes do início da janela temporal.";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window that starts before January 1, 1970." = "Uma ou mais paragens (%@) possuem uma janela temporal que tem início antes de 1 de janeiro de 1970.";

/* No comment provided by engineer. */
"One or more stops (%@) have an invalid curb approach." = "Uma ou mais paragens (%@) possuem uma aproximação de curva inválida.";

/* No comment provided by engineer. */
"Open in Safari" = "Abrir no Safari";

/* No comment provided by engineer. */
"Password" = "Palavra-passe";

/* No comment provided by engineer. */
"Please enter a name for the new attachment" = "Por favor insira um nome para o novo anexo.";

/* No comment provided by engineer. */
"Polygon barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "A barreira de polígonos (%1$@) possui atributos de custo escalados negativos ou zero (%2$@).";

/* No comment provided by engineer. */
"Polyline barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "A barreira de polilinhas (%1$@) possui atributos de custo escalados negativos ou zero (%2$@).";

/* No comment provided by engineer. */
"Polylines cannot be returned." = "As polilinhas não podem ser devolvidas.";

/* No comment provided by engineer. */
"Public Account user cannot access this application." = "Não é possível à Conta Pública aceder a esta aplicação.";

/* No comment provided by engineer. */
"Remove Part" = "Remover Parte";

/* No comment provided by engineer. */
"Remove Vertex" = "Remover Vértice";

/* No comment provided by engineer. */
"Reordering stops (Traveling Salesman Problem) is not supported when the collection of stops contains waypoints or rest breaks." = "Reordenar paragens (O Problema do Caixeiro Viajante) não é suportado no caso de a coleção de paragens conter pontos de rota ou paragens para descanso.";

/* No comment provided by engineer. */
"Reset to Default Values" = "Definir para Valores Predefinidos";

/* No comment provided by engineer. */
"Retry" = "Tentar Novamente";

/* No comment provided by engineer. */
"Route starts or ends on a waypoint." = "A rota começa ou termina num ponto de rota.";

/* No comment provided by engineer. */
"Save Image" = "Guardar Imagem";

/* No comment provided by engineer. */
"Save Movie" = "Guardar Filme";

/* No comment provided by engineer. */
"Sign In" = "Iniciar sessão";

/* No comment provided by engineer. */
"Skip" = "Saltar";

/* No comment provided by engineer. */
"Small" = "Pequeno";

/* No comment provided by engineer. */
"Specified start time occurs before January 1, 1970." = "A data de início especificada ocorre antes de 1 de Janeiro de 1970.";

/* No comment provided by engineer. */
"Stop (%1$@) has invalid added cost attribute names (%2$@)." = "A paragem (%1$@) tem nomes de atributos de custos adicionais inválidos (%2$@).";

/* No comment provided by engineer. */
"Take Photo or Video" = "Obter foto ou vídeo";

/* No comment provided by engineer. */
"The default impedance cutoff is invalid." = "O limite de impedância predefinido é inválido.";

/* No comment provided by engineer. */
"The default target facility count is invalid." = "A contagem de instalações-alvo predefinidas é inválida.";

/* No comment provided by engineer. */
"The directions distance attribute name (%@) is invalid." = "O nome do atributo de distância de direções (%@) é inválido.";

/* No comment provided by engineer. */
"The directions language is invalid." = "A linguagem de direções é inválida.";

/* No comment provided by engineer. */
"The directions road class attribute is invalid." = "O atributo de classse de estrada das direções é inválido.";

/* No comment provided by engineer. */
"The directions style is invalid." = "O estilo de direções é inválido.";

/* No comment provided by engineer. */
"The directions time attribute name (%@) is invalid." = "O nome do atributo de tempo de direções (%@) é inválido.";

/* No comment provided by engineer. */
"The impedance attribute name (%@) is invalid." = "O nome do atributo de impedância (%@) é inválido.";

/* No comment provided by engineer. */
"The input spatial reference is undefined." = "A referência espacial de entrada não está definida.";

/* No comment provided by engineer. */
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "A rede não possui um atributo de hierarquia para realizar o planeamento hierárquico de rota.";

/* No comment provided by engineer. */
"The object must first be saved to a portal using the 'saveAs:' method." = "O objecto deve ser guardado primeiro num portal utilizando o método 'guardarComo:'.";

/* No comment provided by engineer. */
"The output spatial reference is undefined." = "A referência espacial de saída não está definida.";

/* No comment provided by engineer. */
"The polygon buffer distance is invalid." = "A distância do buffer de polígonos é inválida.";

/* No comment provided by engineer. */
"The resource you are looking for might have been removed, had its name changed, or is temporarily unavailable" = "O recurso de que está à procura pode ter sido removido, o respetivo nome pode ter sido alterado ou pode estar temporariamente indisponível.";

/* No comment provided by engineer. */
"The resulting route has traversed one or more soft-restricted elements (%@)." = "A rota resultante atravessou um ou mais elementos restritos soft (%@).";

/* No comment provided by engineer. */
"The route is too large to solve using the walking travel mode." = "A rota é demasiado extensa para resolver utilizando o modo de viagem a pé.";

/* No comment provided by engineer. */
"The search where clause is not supported." = "A pesquisa na qual a cláusula não é suportada.";

/* No comment provided by engineer. */
"The server’s certificate is invalid. You might be connecting to a server that is pretending to be '%@', which could put your confidential information at risk. Would you like to connect anyway?" = "O certificado do servidor não é válido. Poderá estar a ligar-se a um servidor que se faz passar por '%@', o que poderá colocar a sua informação confidencial em risco. Pretende ligar-se mesmo assim?";

/* No comment provided by engineer. */
"The service cannot properly calculate time shift." = "O serviço não consegue calcular a mudança de hora de modo apropriado.";

/* No comment provided by engineer. */
"The specified clientID is invalid" = "O clientID específico é inválido";

/* No comment provided by engineer. */
"The stop type property was ignored for stops (%@) because the server does not support selected type of stop." = "A propriedade tipo de paragem foi ignorada para paragens (%@) dado que o servidor não suporta o tipo de paragem selecionado.";

/* No comment provided by engineer. */
"The travel mode has been set to default." = "O modo de viagem foi alterado para a predefinição.";

/* No comment provided by engineer. */
"The waypoints (%@) contain added cost attribute." = "Os pontos de rota (%@) contêm atributo de custo adicional.";

/* No comment provided by engineer. */
"The waypoints (%@) contain time windows." = "Os pontos de rota (%@) contêm janelas temporais.";

/* No comment provided by engineer. */
"There was an error loading the feature. Please check your network connectivity." = "Ocorreu um erro aso carregar o elemento. Por favor, verifique a conetividade da sua rede.";

/* No comment provided by engineer. */
"Time windows start date was changed." = "A data de início das janelas temporais foi alterada.";

/* No comment provided by engineer. */
"Time windows were ignored because the impedance attribute is not time based." = "As janelas temporais foram ignoradas porque o atributo de impedância não é de base temporal.";

/* No comment provided by engineer. */
"To save as a new item, you must be logged in to the portal." = "Para guardar como novo item, deve ter a sessão iniciada no portal.";

/* No comment provided by engineer. */
"Today" = "Hoje";

/* No comment provided by engineer. */
"Token is invalid or has expired" = "Token inválido ou expirou";

/* No comment provided by engineer. */
"Token URL is nil. You must set a valid token URL on the credential." = "O URL do Token é nulo. Deve definir um URL de token válido na credencial.";

/* No comment provided by engineer. */
"Unable to login with provided credentials." = "Não é possível iniciar sessão com as credenciais fornecidas.";

/* No comment provided by engineer. */
"Unable to retrieve user profile from the provider" = "Não é possível obter o perfil do utilizador junto do fornecedor.";

/* No comment provided by engineer. */
"Unauthorized access" = "Acesso não-autorizado";

/* No comment provided by engineer. */
"Unknown authentication error" = "Erro de autenticação desconhecido";

/* No comment provided by engineer. */
"Unknown condition." = "Condição desconhecida.";

/* No comment provided by engineer. */
"Unknown error occurred" = "Ocorreu um erro desconhecido";

/* No comment provided by engineer. */
"Unsupported GPX data." = "Dados GPX não-suportados.";

/* No comment provided by engineer. */
"User canceled error" = "Erro cancelado pelo utilizador";

/* No comment provided by engineer. */
"User licenses assigned by your organization are invalid. Please contact your administrator to adjust the license assignments and try again." = "As licenças de utilizador atribuídas pela sua organização são inválidas. Por favor, contacte o seu administrador para ajustar as atribuições de licenças e tente novamente.";

/* No comment provided by engineer. */
"Username" = "Nome de Utilizador";

/* No comment provided by engineer. */
"Using browser to authenticate..." = "A utilizar navegador para autenticar...";

/* No comment provided by engineer. */
"Value exceeds maximum field length of %lu" = "O valor excede o comprimento máximo de campo %lu";

/* No comment provided by engineer. */
"You are changing the feature type. Would you like to keep your current values (where possible) or reset to defaults?" = "Está a alterar o tipo de elemento.  Pretende manter os seus valores atuais (quando possível) ou redefinir para valores padrão.";

/* No comment provided by engineer. */
"You cannot sign in because you do not have an organization account associated with your social network credentials" = "Não pode iniciar sessão porque não possui uma conta organizacional associada às suas credenciais de rede social";

/* No comment provided by engineer. */
"You do not have permissions to access this resource" = "Não tem permissões para aceder a este recurso";

/* No comment provided by engineer. */
"You do not have sufficient user level to access this application." = "Não possui um nível de acesso suficiente para aceder a esta aplicação.";

/* No comment provided by engineer. */
"You must be logged in to the Portal to perform this operation." = "Tem de ter sessão iniciada no Portal para para efetuar esta operação.";

/* No comment provided by engineer. */
"You must be specify a rating between 1 and 5." = "Tem de especificar uma classificação entre 1 e 5.";

/* No comment provided by engineer. */
"You must specify a location usage description key (NSLocationWhenInUseUsageDescription or NSLocationAlwaysUsageDescription) in your plist." = "Tem de especificar uma chave de descrição de utilização de localização (NSLocationWhenInUseUsageDescription ou NSLocationAlwaysUsageDescription) na sua lista.";

/* No comment provided by engineer. */
"You need to select a certificate to access the resource '%@'" = "É necessário selecionar um certificado para aceder ao recurso '%@'";

/* No comment provided by engineer. */
"You need to sign in to access the resource '%@'" = "É necessário iniciar sessão para aceder ao recurso '%@'";

/* No comment provided by engineer. */
"• " = "• ";

﻿/* Localizable+Additions.strings */

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Desconhecido";
"yd" = "jardas";

/* Unit Display Strings */
"Centimeters" = "Centímetros";
"Decimal Degrees" = "Graus Decimais";
"Decimeters" = "Decímetros";
"Feet" = "Pés";
"Inches" = "Polegadas";
"Kilometers" = "Quilómetros";
"Meters" = "Metros";
"Miles" = "Milhas";
"Millimeters" = "Milímetros";
"Nautical Miles" = "Milhas Náuticas";
"Points" = "Pontos";
"Yards" = "Jardas";

/* Area Units Abbreviated Strings */
"sq. in" = "poleg2";
"sq. ft" = "pés2";
"sq. yd" = "jardas2";
"ac" = "ac";
"sq. mi" = "milhas2";
"sq. mm" = "mm2";
"sq. cm" = "cm2";
"sq. dm" = "dm2";
"sq. m" = "m2";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "km2";

/* Area Units Display Strings */
"Square Inches" = "Polegadas Quadradas";
"Square Feet" = "Pés Quadrados";
"Square Yards" = "Jardas Quadradas";
"Acres" = "Acres";
"Square Miles" = "Milhas Quadradas";
"Square Millimeters" = "Milimetros Quadrados";
"Square Centimeters" = "Centimetros Quadrados";
"Square Decimeters" = "Decimetros Quadrados";
"Square Meters" = "Metros Quadrados";
"Ares" = "Ares";
"Hectares" = "Hectares";
"Square Kilometers" = "Quilómetros Quadrados";

